Revit 2024 API
View.GetFilters Method
 Gets the filters applied to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ICollection<ElementId> GetFilters()
Visual Basic
Public Function GetFilters As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetFilters()
Return Value
 The ElementIds of the Filters.
Remarks
 Note that this method returns filters in a set sorted according to their ids. To get filters in the order they are applied to the view use GetOrderedFilters().
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace